"""
Директория с файлами, написанные с русскими комментариями.
В большинстве файлов написан код и комментарии, объясняющие строки кода.

Тут можно найти:
- Базовые модули: 3 модуля, я их использую при обучении с нуля, в них содержится вся базовая информация про Python
в последовательном порядке.
- Игры: Сейчас там 2 игры - "Змейка" и "Угадай число". Также есть небольшое знакомство с библиотекой Arcade.
- Боты: Объяснение библиотеки для создания бота в Дискорде, а также простой парсер Youtube.
- Advanced: несколько файлов для продвинутых, чтобы лучше понять, как работают те или иные вещи в Python.

Author:
    Zener

Version:
    1.0.0

License:
    MIT
"""

__all__ = ["Advanced", "Bots", "Games", "Module 1", "Module 2", "Module 3", "all_things"]
